In [5]:
import pandas as pd

# a. Creating a DataFrame

df = pd.DataFrame(
    {'company': ['Amazon','Apple','Google','Facebook','Microsoft'],
     'CEO': ['Jeff Bezos','Tim Cook','Sundar Pichai','Mark Zuckerberg','Satya Nadella'],
     'Founded': [1994,1976,1998,2004,1975]
    }
)
df

     company              CEO  Founded
0     Amazon       Jeff Bezos     1994
1      Apple         Tim Cook     1976
2     Google    Sundar Pichai     1998
3   Facebook  Mark Zuckerberg     2004
4  Microsoft    Satya Nadella     1975

In [6]:
# b. Setting Indexes for a DataFrame

# Now this indexes the dataframe as integers starting at 0. But we can put labels on these.
df.index = ['Third','Second','Fourth','Fifth','First']
df

          company              CEO  Founded
Third      Amazon       Jeff Bezos     1994
Second      Apple         Tim Cook     1976
Fourth     Google    Sundar Pichai     1998
Fifth    Facebook  Mark Zuckerberg     2004
First   Microsoft    Satya Nadella     1975

In [8]:
# c. Indexing a DataFrame

#This prints out a Series.
# df['company']
df.company

Third        Amazon
Second        Apple
Fourth       Google
Fifth      Facebook
First     Microsoft
Name: company, dtype: object

In [11]:
#Now to print out a DataFrame, we can:
df[['company']]

          company
Third      Amazon
Second      Apple
Fourth     Google
Fifth    Facebook
First   Microsoft

In [12]:
df[['company', 'Founded']]

          company  Founded
Third      Amazon     1994
Second      Apple     1976
Fourth     Google     1998
Fifth    Facebook     2004
First   Microsoft     1975

In [13]:
# d. Slicing a DataFrame

df[0:3]

       company            CEO  Founded
Third   Amazon     Jeff Bezos     1994
Second   Apple       Tim Cook     1976
Fourth  Google  Sundar Pichai     1998

In [15]:
# e. More data selection operations

df.loc[['Second', 'Fifth']]

         company              CEO  Founded
Second     Apple         Tim Cook     1976
Fifth   Facebook  Mark Zuckerberg     2004

In [17]:
df.iloc[3]

company           Facebook
CEO        Mark Zuckerberg
Founded               2004
Name: Fifth, dtype: object

In [18]:
df.iloc[:, 1:4] #Getting more than one column

                    CEO  Founded
Third        Jeff Bezos     1994
Second         Tim Cook     1976
Fourth    Sundar Pichai     1998
Fifth   Mark Zuckerberg     2004
First     Satya Nadella     1975